{
  "summary": "Software Engineer specializing in workflow automation, cloud infrastructure, and AI applications. 2.5+ years building scalable Python/Docker/Kubernetes systems, integrating REST APIs with ERP/CRM platforms, and developing NLP/video processing tools. Proven ability to deliver measurable process improvements and deploy production-ready solutions in fast-paced environments.",
  "experience": [
    {
      "title": "Data Automation Engineer | Software Developer",
      "company": "Flowserve",
      "duration": "January 2023 - Present",
      "description": "Reduced manual quoting work by 50% through Python/Docker automation integrating REST APIs with ERP and Salesforce. Built internal Flask tools for real-time quote automation, mirroring modern React/Node.js workflows. Developed API-driven pipelines between ERP, Salesforce, and cloud storage for near real-time sync. Led UAT for 100+ users, ensuring adoption and stability in production."
    },
    {
      "title": "Business Systems Analyst & Data Automation Specialist",
      "company": "Flowserve",
      "duration": "August 2017 - December 2022",
      "description": "Automated CPQ processes using Python, SQL, and Excel VBA, reducing manual quote validation and pricing efforts by 50%. Built and maintained REST API integrations across Oracle CPQ, Salesforce CRM, and ERP systems (JD Edwards, Great Plains) for real-time data synchronization. Developed custom pricing rules, approval workflows, and guided selling flows in Oracle CPQ to support complex product configurations and speed up quoting cycles. Delivered SQL-based sales dashboards to visualize quote status, pricing trends, and KPIs for executive leadership. Led UAT testing, stakeholder demos, and user training for 100+ global sales and operations users, increasing adoption and reducing errors. Participated in Agile development cycles, sprint planning, backlog grooming, and process documentation with Jira and Azure DevOps. Authored detailed technical documentation on API workflows, pricing logic, and business processes to support internal knowledge transfer and system maintenance."
    },
    {
      "title": "Business Systems Developer/Analyst Intern",
      "company": "Salesforce",
      "duration": "May 2021 - August 2021",
      "description": "Collaborated with Solution Architects and MuleSoft Business Analysts to gather, validate, and document client requirements for complex enterprise integration projects. Supported requirements analysis and authored clear documentation covering scope, use cases, and acceptance criteria for customer implementations. Participated in Agile delivery ceremonies and contributed to effort estimation, project scoping, and client communication best practices. Engaged in discovery sessions and stakeholder interviews to align technical solutions with business objectives. Gained hands-on experience with Salesforce ecosystem tools, integration planning, and project documentation standards. Contributed to internal knowledge bases by documenting business process flows, user stories, and lessons learned from client engagements. Developed foundational skills in stakeholder management, solution scoping, and functional requirements documentation."
    }
  ],
  "skills": [
    "Python",
    "SQL",
    "Bash scripting",
    "JavaScript",
    "Shell scripting",
    "Flask",
    "REST APIs",
    "React (concepts)",
    "Node.js (concepts)",
    "AWS (EC2, S3)",
    "Docker",
    "Kubernetes",
    "Prometheus",
    "Grafana",
    "FFmpeg (video transcoding)",
    "OpenCV (image analysis)",
    "spaCy (NLP)",
    "PostgreSQL",
    "Redis",
    "Oracle CPQ",
    "Salesforce CRM",
    "ERP Integration",
    "JD Edwards",
    "Great Plains",
    "Agile Methodologies",
    "Jira",
    "Azure DevOps",
    "Data Automation",
    "ETL Workflows",
    "Business Process Automation",
    "Requirements Gathering",
    "UAT",
    "Data Reporting",
    "Data Visualization",
    "Excel VBA",
    "Git",
    "Terraform",
    "PowerShell",
    "Zapier",
    "LucidChart",
    "Snowflake",
    "MuleSoft",
    "Metadata API",
    "Salesforce CPQ",
    "RevOps",
    "Data Governance",
    "KPI Dashboards",
    "Cross-functional Collaboration",
    "Technical Documentation",
    "Stakeholder Management",
    "Solution Scoping",
    "Business Analysis",
    "User Stories",
    "Acceptance Criteria",
    "Product Management",
    "UI/UX Design",
    "Computer Vision",
    "Data Analysis",
    "Data Structures & Algorithms",
    "Hadoop",
    "jQuery",
    ".NET",
    "Next.js",
    "NoSQL",
    "SAP Products",
    "Web Development",
    "Frontend",
    "Backend",
    "C/C++",
    "Java"
  ],
  "certifications": [
    "CPQ Developer 2024 Certified Implementation Professional – Oracle Cloud Infrastructure"
  ],
  "projects": [
    {
      "name": "ResuMatch – AI-Powered Resume Generator",
      "description": "Developed a production-ready Flask web app and CLI tool that generates ATS-optimized PDFs by analyzing user experience and job descriptions with NLP (spaCy, KeyBERT). Built AI-driven features for job title optimization, summary rewriting, bullet enhancement, and intelligent skill selection; handled 100+ skills with contextual relevance. Designed modular architecture with Python, Docker, and WeasyPrint, enabling fast, scalable resume generation for individual and batch processing.",
      "technologies": ["Python", "Flask", "Docker", "WeasyPrint", "spaCy", "KeyBERT", "NLP", "CLI", "PDF Generation"],
      "github": "https://github.com/akabbas/resumatch",
      "live_demo": "Live demo deployable via Docker"
    },
    {
      "name": "JobPulse – AI-Powered Job Market Analytics Platform",
      "description": "Built a production-ready multi-source job data platform integrating 8+ APIs (GitHub Jobs, Remotive) and advanced Playwright-based scraping for blocked sites; achieved 95%+ success rate in job collection. Designed containerized architecture with Docker and Kubernetes, monitored via Prometheus/Grafana, and deployed to Heroku with autoscaling and optimized slug size (23.9MB). Implemented AI-driven skills extraction, duplicate detection, and real-time analytics processing 10K+ listings/day with 99.9% uptime.",
      "technologies": ["Python", "Docker", "Kubernetes", "Prometheus", "Grafana", "Heroku", "Playwright", "REST APIs", "AI/ML", "Data Analytics"],
      "github": "https://github.com/akabbas/JobPulse",
      "live_demo": "https://secure-oasis-31159-eb4700fd3846.herokuapp.com/"
    },
    {
      "name": "Full Stack Task Manager",
      "description": "Built task management application with React, Node.js, PostgreSQL, and JWT authentication. Deployed on AWS EC2 with Docker.",
      "technologies": ["React", "Node.js", "PostgreSQL", "JWT", "AWS EC2", "Docker"]
    },
    {
      "name": "Weather App",
      "description": "Developed React frontend integrated with OpenWeatherMap API, highlighting data fetching and presentation skills.",
      "technologies": ["React", "OpenWeatherMap API", "JavaScript", "HTML/CSS"]
    },
    {
      "name": "StockTrack - Real-Time Inventory Management",
      "description": "Designed and implemented a web-based inventory management system to enable real-time stock tracking and order processing. Built a RESTful API for real-time integration with supplier databases, reducing order fulfillment times by 30%. Created user-friendly dashboards with custom filtering options, improving data accessibility and helping team members reduce order processing times by 25%.",
      "technologies": ["JavaScript", "HTML", "CSS", "SQL", "Node.js", "REST API"]
    },
    {
      "name": "API Guard - API Monitoring Tool",
      "description": "Created an API monitoring tool to track system health, latency, and performance of critical endpoints. Built a custom alerting system that triggers notifications based on predefined thresholds, improving response times to API issues by 40%. Conducted load testing and optimized database queries to reduce latency, resulting in a more resilient API infrastructure and a 20% reduction in system downtime.",
      "technologies": ["Python", "Flask", "MySQL", "Docker"]
    },
    {
      "name": "Automated Quote Generation System",
      "description": "Developed an automation tool to streamline the process of generating quotes within Oracle CPQ, reducing generation time by 40%. Implemented data validation and error-checking mechanisms, ensuring 100% accuracy in generated quotes. Led the tool deployment across three business units, achieving widespread adoption and a 25% boost in productivity across departments.",
      "technologies": ["Python", "Oracle CPQ", "REST API", "SQL"]
    }
  ],
  "education": [
    {
      "degree": "Bachelor's in Business Computer Information Systems, Minor in Marketing Business Analytics",
      "institution": "University of North Texas (UNT)",
      "year": "2022",
      "gpa": "3.5"
    }
  ],
  "languages": ["Spanish", "Arabic"],
  "contact": {
    "name": "Ammr Abbasher",
    "email": "AmmrAbbasher@gmail.com",
    "phone": "817-575-7791",
    "location": "Dallas, Texas, USA",
    "linkedin": "https://www.linkedin.com/in/ammrab",
    "github": "https://github.com/akabbas"
  }
} 